# SQLite - Basics

[SQL Tutorial](https://www.w3schools.com/sql/default.asp)

## Load ipython-sql

`ipython-sql`:

    - 是jupyter notebook的extension，用來擴充jupyter對SQL的支援
    - 其底層是使用SQLAlchemy

In [1]:
%load_ext sql

## Create Database

The concept of creating or dropping a database is not meant for an embedded database engine like SQLite.

If you want to create DB in SQLite, just from the command line: `sqlite3 databasefilename`.

For example: `sqlite3 test.db`

### Create DB in Jupyter

Because `ipython-sql` is based on `SQLAlchemy`, we can create and connect DB as follow:

In [2]:
%sql sqlite:///test.db

In [3]:
!ls -al

total 32
drwxr-xr-x  5 kakalin  staff    160 May  4 23:14 .
drwxr-xr-x  9 kakalin  staff    288 May  4 23:03 ..
drwxr-xr-x  3 kakalin  staff     96 May  4 23:01 .ipynb_checkpoints
-rw-r--r--@ 1 kakalin  staff  15118 May  4 23:13 sqlite-basics.ipynb
-rw-r--r--  1 kakalin  staff      0 May  4 23:14 test.db

## CRUD

- C: Create
- R: Read
- U: Update
- D: Delete

![](https://raw.githubusercontent.com/kaka-lin/Notes/master/DB/images/crud.png)

### Create Table

In [4]:
%%sql
CREATE TABLE persions(
    persion_id integer primary key autoincrement,
    firstname varchar(255),
    lastname varchar(255),
    age int,
    height int,
    weight int,
    city varchar(255)
);

 * sqlite:///test.db
Done.

[]

### Create Data

In [5]:
%%sql
INSERT INTO persions
    VALUES(1, 'kaka','Lin', 28, 175, 70, 'Taipei');
INSERT INTO persions (firstname, lastname, age, height, weight, city) 
    VALUES('kiwi','Li', 30, 173, 70, 'Taipei');

 * sqlite:///test.db
1 rows affected.
1 rows affected.

[]

### Read Data

In [6]:
%%sql

SELECT * 
    FROM persions;

 * sqlite:///test.db
Done.

[(1, 'kaka', 'Lin', 28, 175, 70, 'Taipei'),
 (2, 'kiwi', 'Li', 30, 173, 70, 'Taipei')]

### Update Data

In [7]:
%%sql

UPDATE persions
    SET weight = 68
    -- or WHERE persion_id = 1
    WHERE firstname = 'kaka';

 * sqlite:///test.db
1 rows affected.

[]

In [8]:
%%sql

SELECT * 
    FROM persions;

 * sqlite:///test.db
Done.

[(1, 'kaka', 'Lin', 28, 175, 68, 'Taipei'),
 (2, 'kiwi', 'Li', 30, 173, 70, 'Taipei')]

### Delete Data

Before we delete data,
we first add the data that we want to delete.

In [9]:
%%sql

INSERT INTO persions (firstname, lastname, age, height, weight, city) 
    VALUES('albert','Lin', 28, 180, 70, 'Taipei');

 * sqlite:///test.db
1 rows affected.

[]

In [10]:
%%sql

SELECT * 
    FROM persions;

 * sqlite:///test.db
Done.

[(1, 'kaka', 'Lin', 28, 175, 68, 'Taipei'),
 (2, 'kiwi', 'Li', 30, 173, 70, 'Taipei'),
 (3, 'albert', 'Lin', 28, 180, 70, 'Taipei')]

In [11]:
%%sql

DELETE FROM persions
    WHERE persion_id = 3;

 * sqlite:///test.db
1 rows affected.

[]

In [12]:
%%sql

SELECT * 
    FROM persions;

 * sqlite:///test.db
Done.

[(1, 'kaka', 'Lin', 28, 175, 68, 'Taipei'),
 (2, 'kiwi', 'Li', 30, 173, 70, 'Taipei')]

## Drop Database

If we want to drop DB in SQLite,just delete the file.

In [13]:
!rm -rf test.db
!ls -al

total 32
drwxr-xr-x  4 kakalin  staff    128 May  4 23:14 .
drwxr-xr-x  9 kakalin  staff    288 May  4 23:03 ..
drwxr-xr-x  3 kakalin  staff     96 May  4 23:01 .ipynb_checkpoints
-rw-r--r--@ 1 kakalin  staff  15118 May  4 23:13 sqlite-basics.ipynb